Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/Microchip.PIC32CX-MT_DEV_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.ATMEL.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>PIC32CX-MT_DEV_DFP</name>
   <description>Microchip PIC32CX-MT Series Device Support</description>
   <releases>
      <release version="0.1.33" date="2022-05-02">Internal!</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>PIC32CX-MT</keyword>
   </keywords>
   <devices>
      <family Dfamily="PIC32CX-MT" Dvendor="Microchip:3">
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                            schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="PIC32CX1025MTC128">
            <processor Dcore="Cortex-M4"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="SP_FPU"/>
            <compile header="PIC32CX-MTC/include/pic32c.h" define="__PIC32CX1025MTC128__"/>
            <memory id="IROM1"
                    start="0x01000000"
                    size="0x00080000"
                    default="1"
                    startup="1"/>
            <memory id="IROM2" start="0x01080000" size="0x00080000"/>
            <memory id="IROM3" start="0x11000000" size="0x00080000"/>
            <memory id="IROM4" start="0x11080000" size="0x00080000"/>
            <memory id="IRAM1" start="0x20000000" size="0x00040000" default="1"/>
            <memory id="IRAM2" start="0x20080000" size="0x00008000"/>
            <memory id="IRAM3" start="0x20088000" size="0x00004000"/>
            <algorithm name="PIC32CX-MTC/keil/flash/PIC32CXMT_1024.FLM"
                       start="0x01000000"
                       size="0x100000"
                       default="1"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="PIC32CX-MTC/atdf/PIC32CX1025MTC128.atdf"/>
                  <at:variant ordercode="PIC32CX1025MTC128-AU"
                              vccmin="2.25"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+85"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             address-space="base"/>
                  <at:memory name="IFLASH0"
                             start="0x01000000"
                             size="0x00080000"
                             type="flash"
                             pagesize="512"
                             address-space="base"/>
                  <at:memory name="IFLASH1"
                             start="0x01080000"
                             size="0x00080000"
                             type="flash"
                             pagesize="512"
                             address-space="base"/>
                  <at:memory name="CPKCC_ROM"
                             start="0x02020000"
                             size="0x00010000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="CPKCC_RAM"
                             start="0x02031000"
                             size="0x00001000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="QSPI_MEM"
                             start="0x04000000"
                             size="0x02000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="QSPI_AESB"
                             start="0x06000000"
                             size="0x02000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="IFLASH0_CC"
                             start="0x11000000"
                             size="0x00080000"
                             type="flash"
                             pagesize="512"
                             address-space="base"/>
                  <at:memory name="IFLASH1_CC"
                             start="0x11080000"
                             size="0x00080000"
                             type="flash"
                             pagesize="512"
                             address-space="base"/>
                  <at:memory name="QSPI_MEM_CC"
                             start="0x14000000"
                             size="0x02000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="QSPI_AESB_CC"
                             start="0x16000000"
                             size="0x02000000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="DTCM"
                             start="0x1FFFA000"
                             size="0x00002000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="ITCM"
                             start="0x1FFFC000"
                             size="0x00004000"
                             type="other"
                             address-space="base"/>
                  <at:memory name="IRAM0"
                             start="0x20000000"
                             size="0x00040000"
                             type="ram"
                             address-space="base"/>
                  <at:memory name="IRAM1"
                             start="0x20080000"
                             size="0x00008000"
                             type="ram"
                             address-space="base"/>
                  <at:memory name="IRAM2"
                             start="0x20088000"
                             size="0x00004000"
                             type="ram"
                             address-space="base"/>
                  <at:memory name="CORTEXM_PRIVATE_PB"
                             start="0xE0000000"
                             size="0x00100000"
                             type="other"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="PIC32CX-MTC/edc/PIC32CX1025MTC128.PIC"/>
                  <mchp:xc32 name="PIC32CX-MTC/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="PIC32CX-MTC/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="PIC32CX-MTC/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICD4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="PIC32CX-MTC/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32CX1025MTC128"
                  title="Device page for PIC32CX1025MTC128"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32CX1025MTC128"
                  title="Datasheet"/>
         </device>
         <device Dname="PIC32CX1025MTC128S1">
            <processor Dcore="Cortex-M4"
                       Dendian="Little-endian"
                       Dmpu="MPU"
                       Dfpu="SP_FPU"/>
            <compile header="PIC32CX-MTC/include/pic32c.h" define="__PIC32CX1025MTC128S1__"/>
            <memory id="IRAM1" start="0x20080000" size="0x00008000" default="1"/>
            <memory id="IRAM2" start="0x20088000" size="0x00004000"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="PIC32CX-MTC/atdf/PIC32CX1025MTC128S1.atdf"/>
                  <at:variant ordercode="PIC32CX1025MTC128-AU"
                              vccmin="2.25"
                              vccmax="3.6"
                              tempmin="-40"
                              tempmax="+85"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             address-space="base"/>
                  <at:memory name="IRAM1"
                             start="0x20080000"
                             size="0x00008000"
                             type="ram"
                             address-space="base"/>
                  <at:memory name="IRAM2"
                             start="0x20088000"
                             size="0x00004000"
                             type="ram"
                             address-space="base"/>
                  <at:memory name="CORTEXM_PRIVATE_PB"
                             start="0xE0000000"
                             size="0x00100000"
                             type="other"
                             address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="PIC32CX-MTC/edc/PIC32CX1025MTC128S1.PIC"/>
                  <mchp:xc32 name="PIC32CX-MTC/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="PIC32CX-MTC/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="PIC32CX-MTC/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmSimulator.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="PIC32CX-MTC/hwtools/sdm/sdmICD4.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="PIC32CX-MTC/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32CX1025MTC128S1"
                  title="Device page for PIC32CX1025MTC128S1"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32CX1025MTC128S1"
                  title="Datasheet"/>
         </device>
