Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/Microchip.PIC32CX-MT_DEV_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="0.1.0"
                 condition="PIC32CX2051MTC128">
         <description>Headers and startup code for Microchip PIC32CX2051MTC128</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTC/include/"/>
            <file condition="C" category="header" name="PIC32CX-MTC/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTC/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTC/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTC/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTC/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTC/gcc/gcc/startup_pic32cx2051mtc128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTC/gcc/system_pic32cx2051mtc128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTC/gcc/gcc/pic32cx2051mtc128_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CX-MTC/gcc/gcc/pic32cx2051mtc128_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTC/armcc/armcc/startup_pic32cx2051mtc128.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTC/armcc/system_pic32cx2051mtc128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTC/iar/iar/startup_pic32cx2051mtc128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTC/iar/system_pic32cx2051mtc128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTC/iar/config/linker/Microchip/pic32cx2051mtc128/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CX-MTC/iar/config/linker/Microchip/pic32cx2051mtc128/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="0.1.0"
                 condition="PIC32CX2051MTC128S1">
         <description>Headers and startup code for Microchip PIC32CX2051MTC128S1</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTC/include/"/>
            <file condition="C" category="header" name="PIC32CX-MTC/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTC/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTC/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTC/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTC/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTC/gcc/gcc/startup_pic32cx2051mtc128s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTC/gcc/system_pic32cx2051mtc128s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTC/gcc/gcc/pic32cx2051mtc128s1_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTC/armcc/armcc/startup_pic32cx2051mtc128s1.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTC/armcc/system_pic32cx2051mtc128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTC/iar/iar/startup_pic32cx2051mtc128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTC/iar/system_pic32cx2051mtc128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTC/iar/config/linker/Microchip/pic32cx2051mtc128s1/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="0.1.0"
                 condition="PIC32CX2051MTG128">
         <description>Headers and startup code for Microchip PIC32CX2051MTG128</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTG/include/"/>
            <file condition="C" category="header" name="PIC32CX-MTG/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTG/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTG/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTG/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTG/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTG/gcc/gcc/startup_pic32cx2051mtg128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTG/gcc/system_pic32cx2051mtg128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTG/gcc/gcc/pic32cx2051mtg128_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CX-MTG/gcc/gcc/pic32cx2051mtg128_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTG/armcc/armcc/startup_pic32cx2051mtg128.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTG/armcc/system_pic32cx2051mtg128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTG/iar/iar/startup_pic32cx2051mtg128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTG/iar/system_pic32cx2051mtg128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTG/iar/config/linker/Microchip/pic32cx2051mtg128/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CX-MTG/iar/config/linker/Microchip/pic32cx2051mtg128/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="0.1.0"
                 condition="PIC32CX2051MTG64">
         <description>Headers and startup code for Microchip PIC32CX2051MTG64</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTG/include/"/>
            <file condition="C" category="header" name="PIC32CX-MTG/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTG/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTG/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTG/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTG/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTG/gcc/gcc/startup_pic32cx2051mtg64.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTG/gcc/system_pic32cx2051mtg64.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTG/gcc/gcc/pic32cx2051mtg64_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CX-MTG/gcc/gcc/pic32cx2051mtg64_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTG/armcc/armcc/startup_pic32cx2051mtg64.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTG/armcc/system_pic32cx2051mtg64.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTG/iar/iar/startup_pic32cx2051mtg64.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTG/iar/system_pic32cx2051mtg64.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTG/iar/config/linker/Microchip/pic32cx2051mtg64/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CX-MTG/iar/config/linker/Microchip/pic32cx2051mtg64/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="0.1.0"
                 condition="PIC32CX2051MTSH128">
         <description>Headers and startup code for Microchip PIC32CX2051MTSH128</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTSH/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CX-MTSH/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTSH/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTSH/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTSH/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTSH/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/gcc/gcc/startup_pic32cx2051mtsh128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/gcc/system_pic32cx2051mtsh128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTSH/gcc/gcc/pic32cx2051mtsh128_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CX-MTSH/gcc/gcc/pic32cx2051mtsh128_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/armcc/armcc/startup_pic32cx2051mtsh128.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/armcc/system_pic32cx2051mtsh128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTSH/iar/iar/startup_pic32cx2051mtsh128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTSH/iar/system_pic32cx2051mtsh128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTSH/iar/config/linker/Microchip/pic32cx2051mtsh128/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CX-MTSH/iar/config/linker/Microchip/pic32cx2051mtsh128/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="0.1.0"
                 condition="PIC32CX2051MTSH128S1">
         <description>Headers and startup code for Microchip PIC32CX2051MTSH128S1</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTSH/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CX-MTSH/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTSH/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTSH/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTSH/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTSH/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/gcc/gcc/startup_pic32cx2051mtsh128s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/gcc/system_pic32cx2051mtsh128s1.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTSH/gcc/gcc/pic32cx2051mtsh128s1_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/armcc/armcc/startup_pic32cx2051mtsh128s1.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTSH/armcc/system_pic32cx2051mtsh128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTSH/iar/iar/startup_pic32cx2051mtsh128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTSH/iar/system_pic32cx2051mtsh128s1.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTSH/iar/config/linker/Microchip/pic32cx2051mtsh128s1/sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="0.1.0"
                 condition="PIC32CX5112MTC128">
         <description>Headers and startup code for Microchip PIC32CX5112MTC128</description>
         <files>
            <file condition="C" category="include" name="PIC32CX-MTC/include/"/>
            <file condition="C" category="header" name="PIC32CX-MTC/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTC/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CX-MTC/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTC/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CX-MTC/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTC/gcc/gcc/startup_pic32cx5112mtc128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CX-MTC/gcc/system_pic32cx5112mtc128.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CX-MTC/gcc/gcc/pic32cx5112mtc128_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CX-MTC/gcc/gcc/pic32cx5112mtc128_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTC/armcc/armcc/startup_pic32cx5112mtc128.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CX-MTC/armcc/system_pic32cx5112mtc128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTC/iar/iar/startup_pic32cx5112mtc128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CX-MTC/iar/system_pic32cx5112mtc128.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CX-MTC/iar/config/linker/Microchip/pic32cx5112mtc128/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CX-MTC/iar/config/linker/Microchip/pic32cx5112mtc128/flash.icf"
                  attr="config"/>
         </files>
      </component>
